app/views/quarterly_budgets/show.html.erb

          <td><%= expenditure.item %></td>
          <td><%= SettingsType.find(expenditure.type_id).description %></td>
---
SELECT  `settings_types`.* FROM `settings_types`  WHERE `settings_types`.`id` = 1 LIMIT 1