app/controllers/expenditures_controller.rb

SELECT `expenditures`.* FROM `expenditures`
---
  def index
    @expenditures = Expenditure.all

SELECT  `quarterly_budgets`.* FROM `quarterly_budgets`  WHERE `quarterly_budgets`.`quarterly_budget_id` = '1' LIMIT 1
---
  def new
    if params["quarterly_budget_id"]
      @quarterly_budget = QuarterlyBudget.find_by id: params["quarterly_budget_id"]

INSERT INTO `expenditures` (`cost`, `created_at`, `item`, `notes`, `purchase_date`, `quarterly_budget_id`, `type_id`, `updated_at`) VALUES (5.0, '2014-06-19 17:40:18', 'Starbucks', 'Chipotle made me thirsty', '2014-06-19', 1, 1, '2014-06-19 17:40:18')
---
  def create
    @expenditure = Expenditure.new(expenditure_params)

    respond_to do |format|
      if @expenditure.save

UPDATE `expenditures` SET `cost` = 10.0, `item` = 'Chipotle', `notes` = 'Yum!', `updated_at` = '2014-06-17 19:42:55' WHERE `expenditures`.`id` = 1
---
  def update
    respond_to do |format|
      if @expenditure.update(expenditure_params)

SELECT `quarterly_budgets`.* FROM `quarterly_budgets`
SELECT `settings_types`.* FROM `settings_types`
---
  def load_arrays_for_create
    @quarterly_budgets = QuarterlyBudget.all.map{|budget| [budget, budget.id]}
    @types = SettingsType.all.map{|type| [type.description, type.id]}

SELECT  `expenditures`.* FROM `expenditures`  WHERE `expenditures`.`id` = 1 LIMIT 1
---
    def set_expenditure
      @expenditure = Expenditure.find(params[:id])