app/controllers/quarterly_budgets_controller.rb

  def index
    @quarterly_budgets = QuarterlyBudget.all
---
SELECT `quarterly_budgets`.* FROM `quarterly_budgets`

  def create
    @quarterly_budget = QuarterlyBudget.new(quarterly_budget_params)

    respond_to do |format|
      if @quarterly_budget.save
---
INSERT INTO `quarterly_budgets` (`created_at`, `current_balance`, `end_balance`, `quarter`, `start_balance`, `updated_at`, `year`) VALUES ('2014-06-16 18:32:21', 100.0, 100.0, 1, 100.0, '2014-06-16 18:32:21', 2014)

  def update
    respond_to do |format|
      if @quarterly_budget.update(quarterly_budget_params)
---
UPDATE `quarterly_budgets` SET `start_balance` = 150.0, `updated_at` = '2014-06-17 17:52:12' WHERE `quarterly_budgets`.`id` = 2

    def set_quarterly_budget
      @quarterly_budget = QuarterlyBudget.find(params[:id])
---
SELECT  `quarterly_budgets`.* FROM `quarterly_budgets`  WHERE `quarterly_budgets`.`id` = 1 LIMIT 1