app/controllers/settings_types_controller.rb

SELECT `settings_types`.* FROM `settings_types`
---
  def index
    @settings_types = SettingsType.order(sort_column + ' ' + sort_direction)

INSERT INTO `settings_types` (`created_at`, `description`, `updated_at`) VALUES ('2014-06-16 20:11:14', 'Food', '2014-06-16 20:11:14')
---
  def create
    @settings_type = SettingsType.new(settings_type_params)

    respond_to do |format|
      if @settings_type.save

DELETE FROM `settings_types` WHERE `settings_types`.`id` = 2
---
  def destroy
    @settings_type.destroy

SELECT  `settings_types`.* FROM `settings_types`  WHERE `settings_types`.`id` = 3 LIMIT 1
---
    def set_settings_type
      @settings_type = SettingsType.find(params[:id])