app/views/expenditures/index.html.erb

      <%= content_tag_for(:tr, expenditure) do %>
        <td><%= QuarterlyBudget.find(expenditure.quarterly_budget_id).to_s %></td>
---
SELECT  `quarterly_budgets`.* FROM `quarterly_budgets`  WHERE `quarterly_budgets`.`id` = 1 LIMIT 1

        <td><%= expenditure.item %></td>
        <td><%= SettingsType.find(expenditure.type_id).description %></td>
---
SELECT  `settings_types`.* FROM `settings_types`  WHERE `settings_types`.`id` = 1 LIMIT 1