app/views/expenditures/show.html.erb

        <dt><label><%= 'Item:' %></label></dt><dd><%= @expenditure.item %></dd>
        <dt><label><%= 'Type:' %></label></dt><dd><%= SettingsType.find(@expenditure.type_id).description %></dd>
---
SELECT  `settings_types`.* FROM `settings_types`  WHERE `settings_types`.`id` = 1 LIMIT 1